[
  "Couples are eligible for joint assessment if they that are married to each other in the assessment year, are both subject to unlimited tax liability, and live together for at least one day",
  "A person is considered to be living together with their spouse if they share a common residence and maintain a shared household",
  "A couple is considered married if they are legally married, in a registered civil partnership for at least one day in the assessment year",
  "If either spouse is subject to limited tax liability, they are not eligible for joint assessment",
  "A person is subject to unlimited tax liability if they have a residence or habitual abode in Germany",
  "A widow or widower can opt for joint assessment with their deceased spouse's income for the year of death and the following year, provided they have not remarried",
  "Joint assessment is often more beneficial for couples where one spouse has a significantly higher income than the other",
  "Wage replacement benefits are tax-free, but they affect the tax rate applied to other income",
  "Extraordinary expenses can be deducted if they exceed a certain percentage of the taxpayer's income",
  "Church tax is calculated based on the income tax amount",
  "For couples with mixed religion, church tax is calculated separately for each spouse",
  "For couples where only one spouse is subject to church tax and earns significantly less than the other, it may be beneficial to file separately due to the specific church tax calculation",
  "Parents can take a total amount of 14 months of parental time off, but only a maximum of 12 months can be taken by one parent",
  "Parental benefits are calculated based on the average monthly income and capped to a maximum amount of 1800 euros per month",
  "Under German tax law, costs for a home office can be deducted if the home office is the center of the entire professional activity or if no other workplace is available for professional use",
  "Deductible costs for a home office are calculated on a pro-rata basis (e.g., based on square meters).",
  "Employees can claim a flat rate per kilometer of their one-way commute for each workday. As of recent regulations, this is €0.30 for the first 20 km and €0.38 for each kilometer thereafter.",
  "For travel expenses to a primary place of work, a taxpayer can claim either the calculated commuter allowance or the actual cost of public transport tickets, whichever amount is higher."
]